### Disciplina de Análise de Dados    
### Curso de Gestão de Dados
### Universidade Federal do Piauí
##### Prof. Arlino Magalhães
arlino@ufpi.edu.br | @arlino.magalhaes


# Análise de dados com Pandas

Referência: Tadewald, Rodrigo. Python para Data Science e Machine Learning. Disponível em: Udemy, 2021. 
| Link da Udemy: https://www.udemy.com/course/python-para-data-science-e-machine-learning/

# DataFrames

DataFrame é o elemeto mais importante dos Pandas e são diretamente inspirados pela linguagem de programação R. Podemos pensar em um DataFrame como um conjunto de objetos da série juntos para compartilhar o mesmo índice. Vamos usar Pandas para explorar esse tópico!

In [1]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [5]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [6]:
df = pd.DataFrame(np.random.randn(5,4),index=['A', 'B', 'C', 'D', 'E'],columns='W X Y Z'.split())

In [7]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Seleção e indexação

Vamos aprender os vários métodos para pegar dados de um DataFrame

In [8]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [9]:
# Passando uma lista com nomes das colunas
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [10]:
# Sintaxe SQL (Não recomendado!)
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

As colunas dos DataFrames são Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
type(df['W'])

pandas.core.series.Series

** Criando uma coluna: **

In [13]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

** Removendo colunas **

In [14]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [15]:
# Porém, tal exclusão só ocorrerá se especificada no parâmetro inplace
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [16]:
df.drop('new',axis=1,inplace=True)

In [17]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Também podemos deletar linha desta forma:

In [18]:
df.drop('D',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

** Selecionando linhas: **

In [19]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

Ou selecione com base na posição em vez do rótulo

In [20]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

** Selecionando o subconjunto de linhas e colunas **

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df.loc['B','Y']

0.16690463609281317

In [23]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [24]:
df.iloc[0:2, [0,3]]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502

### Seleção condicional

Uma característica importante dos pandas é a seleção condicional usando notação de colchetes, muito semelhante ao numpy:

In [25]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [26]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [27]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [28]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [29]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [30]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

Para duas condições, você pode usar | e & com parênteses:

In [31]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## Mais Detalhes do Índice

Vamos discutir mais alguns recursos de indexação, incluindo resetar o índice ou configurá-lo de outra forma. Também falaremos sobre hierarquia de índice!

In [32]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [33]:
# Redefinir para o padrão 0,1 ... n índice
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [34]:
novoind = 'CA NY WY OR CO'.split()
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [35]:
df['Estados'] = novoind

In [36]:
df

          W         X         Y         Z Estados
A  0.302665  1.693723 -1.706086 -1.159119      CA
B -0.134841  0.390528  0.166905  0.184502      NY
C  0.807706  0.072960  0.638787  0.329646      WY
D -0.497104 -0.754070 -0.943406  0.484752      OR
E -0.116773  1.901755  0.238127  1.996652      CO

In [37]:
df.set_index('Estados')

                W         X         Y         Z
Estados
CA       0.302665  1.693723 -1.706086 -1.159119
NY      -0.134841  0.390528  0.166905  0.184502
WY       0.807706  0.072960  0.638787  0.329646
OR      -0.497104 -0.754070 -0.943406  0.484752
CO      -0.116773  1.901755  0.238127  1.996652

In [38]:
df

          W         X         Y         Z Estados
A  0.302665  1.693723 -1.706086 -1.159119      CA
B -0.134841  0.390528  0.166905  0.184502      NY
C  0.807706  0.072960  0.638787  0.329646      WY
D -0.497104 -0.754070 -0.943406  0.484752      OR
E -0.116773  1.901755  0.238127  1.996652      CO

In [39]:
df.set_index('Estados',inplace=True)

In [40]:
df

                W         X         Y         Z
Estados
CA       0.302665  1.693723 -1.706086 -1.159119
NY      -0.134841  0.390528  0.166905  0.184502
WY       0.807706  0.072960  0.638787  0.329646
OR      -0.497104 -0.754070 -0.943406  0.484752
CO      -0.116773  1.901755  0.238127  1.996652

## Hierarquia de índices e índices múltiplos

Vamos examinar como trabalhar com o Multi-Index, primeiro criaremos um exemplo rápido de como seria um DataFrame Multi-Indexado:

In [41]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [42]:
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [43]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [44]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

Agora vamos mostrar como indexar isso! Para a hierarquia de índice, usamos df.loc []. Se este fosse no eixo das colunas, você usaria a notação de suporte normal df []. Chamar um nível do índice retorna um sub-dataframe:

In [45]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [46]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [47]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [48]:
df.index.names

FrozenList([None, None])

In [49]:
df.index.names = ['Grupo','Número']

In [50]:
df

                     A         B
Grupo Número
G1    1      -0.993263  0.196800
      2      -1.136645  0.000366
      3       1.025984 -0.156598
G2    1      -0.031579  0.649826
      2       2.154846 -0.610259
      3      -0.755325 -0.346419

In [51]:
df.xs('G1')

               A         B
Número
1      -0.993263  0.196800
2      -1.136645  0.000366
3       1.025984 -0.156598

In [52]:
df.xs(['G1',1])

C:\Users\Arlindo UFPI\AppData\Local\Temp\ipykernel_9336\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -0.993263
B    0.196800
Name: (G1, 1), dtype: float64

In [53]:
df

                     A         B
Grupo Número
G1    1      -0.993263  0.196800
      2      -1.136645  0.000366
      3       1.025984 -0.156598
G2    1      -0.031579  0.649826
      2       2.154846 -0.610259
      3      -0.755325 -0.346419

In [54]:
df.xs(1,level='Número')

              A         B
Grupo
G1    -0.993263  0.196800
G2    -0.031579  0.649826